{
  "architectures": [
    "ConvNextForImageClassification"
  ],
  "depths": [
    3,
    3,
    9,
    3
  ],
  "drop_path_rate": 0.0,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_sizes": [
    96,
    192,
    384,
    768
  ],
  "id2label": {
    "0": "Avian Influenza",
    "1": "Coccidiosis",
    "2": "Fowl Pox",
    "3": "Healthy",
    "4": "Histomoniasis",
    "5": "Infectious Bronchitis",
    "6": "Infectious Bursal Disease",
    "7": "Marek's Disease",
    "8": "Newcastle Disease",
    "9": "Salmonella"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "Avian Influenza": 0,
    "Coccidiosis": 1,
    "Fowl Pox": 2,
    "Healthy": 3,
    "Histomoniasis": 4,
    "Infectious Bronchitis": 5,
    "Infectious Bursal Disease": 6,
    "Marek's Disease": 7,
    "Newcastle Disease": 8,
    "Salmonella": 9
  },
  "layer_norm_eps": 1e-12,
  "layer_scale_init_value": 1e-06,
  "model_type": "convnext",
  "num_channels": 3,
  "num_stages": 4,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "patch_size": 4,
  "problem_type": "single_label_classification",
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "transformers_version": "4.57.1"
}
