{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "dtype": "float32",
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Avian Influenza",
    "1": "Coccidiosis",
    "2": "Fowl Pox",
    "3": "Healthy",
    "4": "Histomoniasis",
    "5": "Infectious Bronchitis",
    "6": "Infectious Bursal Disease",
    "7": "Marek's Disease",
    "8": "Newcastle Disease",
    "9": "Salmonella"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Avian Influenza": 0,
    "Coccidiosis": 1,
    "Fowl Pox": 2,
    "Healthy": 3,
    "Histomoniasis": 4,
    "Infectious Bronchitis": 5,
    "Infectious Bursal Disease": 6,
    "Marek's Disease": 7,
    "Newcastle Disease": 8,
    "Salmonella": 9
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "4.57.1"
}
