{
  "architectures": [
    "CvtForImageClassification"
  ],
  "attention_drop_rate": [
    0.0,
    0.0,
    0.0
  ],
  "cls_token": [
    false,
    false,
    true
  ],
  "depth": [
    1,
    2,
    10
  ],
  "drop_path_rate": [
    0.0,
    0.0,
    0.1
  ],
  "drop_rate": [
    0.0,
    0.0,
    0.0
  ],
  "dtype": "float32",
  "embed_dim": [
    64,
    192,
    384
  ],
  "id2label": {
    "0": "Avian Influenza",
    "1": "Coccidiosis",
    "2": "Fowl Pox",
    "3": "Healthy",
    "4": "Histomoniasis",
    "5": "Infectious Bronchitis",
    "6": "Infectious Bursal Disease",
    "7": "Marek's Disease",
    "8": "Newcastle Disease",
    "9": "Salmonella"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "kernel_qkv": [
    3,
    3,
    3
  ],
  "label2id": {
    "Avian Influenza": 0,
    "Coccidiosis": 1,
    "Fowl Pox": 2,
    "Healthy": 3,
    "Histomoniasis": 4,
    "Infectious Bronchitis": 5,
    "Infectious Bursal Disease": 6,
    "Marek's Disease": 7,
    "Newcastle Disease": 8,
    "Salmonella": 9
  },
  "layer_norm_eps": 1e-12,
  "mlp_ratio": [
    4.0,
    4.0,
    4.0
  ],
  "model_type": "cvt",
  "num_channels": 3,
  "num_heads": [
    1,
    3,
    6
  ],
  "num_stages": 3,
  "padding_kv": [
    1,
    1,
    1
  ],
  "padding_q": [
    1,
    1,
    1
  ],
  "patch_padding": [
    2,
    1,
    1
  ],
  "patch_sizes": [
    7,
    3,
    3
  ],
  "patch_stride": [
    4,
    2,
    2
  ],
  "pos_embed": [
    false,
    false,
    false
  ],
  "problem_type": "single_label_classification",
  "qkv_bias": [
    true,
    true,
    true
  ],
  "qkv_projection_method": [
    "dw_bn",
    "dw_bn",
    "dw_bn"
  ],
  "stride_kv": [
    2,
    2,
    2
  ],
  "stride_q": [
    1,
    1,
    1
  ],
  "transformers_version": "4.57.1"
}
